function veracityCheck(points){
    switch(true) {
        case points >= 10:  
            return {veracity: "НЕДОСТОВІРНО"}

        case points < 10 && points > 4: 
            return {veracity: "ДОСТОВІРНО"}

        case points < 5: 
            return {veracity: "ВИСОКА ДОСТОВІРНІСТЬ"}

        default:
            return "WTF_veracityCheck";
    }
}

function behavioralRegulationCheck(points){
    switch(true) {
        case points >= 57:  
            return {name : "Поведінкова регуляція", stans: 1, mark: `${points}`, anwer: "Вкрай високий рівень нервово-психічної нестійкості. Ознаки граничних нервово-психічних розладів. Вкрай низька толерантність до психічних і фізичних навантажень. Адаптація до нових умов життєдіяльності протікає дуже хворобливо з тривалим і вираженим погіршенням функціонального стану організму. Працездатність у даний період часу різко знижена. Посилення психічних навантажень приводить до зриву професійної діяльності"}

        case points < 57 && points > 45:  
            return {name : "Поведінкова регуляція", stans: 2, mark: `${points}`, anwer: "Виражені ознаки нервово-психічної нестійкості і порушення поведінкової регуляції. Низька толерантність до психічних і фізичних навантажень. Адаптація до нових умов життєдіяльності протікає хворобливо. Можливе тривале і виражене погіршення функціонального стану організму. Рівень професійної працездатності у даний період часу низький. При посиленні психічних навантажень достатньо вірогідний зрив професійної діяльності"}

        case points < 46 && points > 34:  
            return {name : "Поведінкова регуляція", stans: 3, mark: `${points}`, anwer: "Окремі ознаки нервово-психічної нестійкості і порушення поведінкової регуляції. Недостатня толерантність до психічних і фізичних навантажень. Адаптація до нових умов життєдіяльності, як правило, ускладнена і може супроводжуватися тривалим погіршенням функціонального стану організму і професійної працездатності. При надзвичайно високих психічних навантаженнях можливий зрив професійної діяльності"}

        case points < 35 && points > 26:  
            return {name : "Поведінкова регуляція", stans: 4, mark: `${points}`, anwer: "Дещо понижений рівень нервово-психічної стійкості і поведінкової регуляції. Нестабільний рівень працездатності, що особливо проявляється в ускладнених умовах діяльності. Адаптація до нових і незвичайних умов життєдіяльності ускладнена і може супроводжуватися тимчасовим погіршенням функціонального стану організму"}

        case points < 27 && points > 18:  
            return {name : "Поведінкова регуляція", stans: 5, mark: `${points}`, anwer: "В цілому достатній рівень нервово-психічної стійкості і поведінкової регуляції. Стійкий рівень працездатності у звичних умовах життєдіяльності. При тривалій дії явних психічних навантажень можливо тимчасове погіршення якості діяльності"}

        case points < 19 && points > 12:  
            return {name : "Поведінкова регуляція", stans: 6, mark: `${points}`, anwer: "Достатній рівень нервово-психічної стійкості і поведінкової регуляції. Достатній рівень працездатності, у тому числі і в ускладнених умовах діяльності. Достатня толерантність до психічних і фізичних навантажень. Достатня стійкість до дії стрес-чинників"}

        case points < 13 && points > 8:  
            return {name : "Поведінкова регуляція", stans: 7, mark: `${points}`, anwer: "Достатньо високий рівень нервово-психічної стійкості і поведінкової регуляції. Достатньо високий рівень працездатності, у тому числі і в ускладнених умовах діяльності. Достатньо висока толерантність до психічних і фізичних навантажень. Достатньо висока стійкість до дії стрес-чинників"}

        case points < 9 && points > 5:  
            return {name : "Поведінкова регуляція", stans: 8, mark: `${points}`, anwer: "Високий рівень нервово-психічної стійкості і поведінкової регуляції. Високий рівень працездатності, у тому числі і в умовах вираженого стресу. Висока толерантність до несприятливих психічних і фізичних навантажень"}

        case points === 5:  
            return {name : "Поведінкова регуляція", stans: 9, mark: `${points}`, anwer: "Високий рівень нервово-психічної стійкості і поведінкової регуляції. Високий рівень працездатності, у тому числі і в умовах вираженого стресу. Висока толерантність до несприятливих психічних і фізичних навантажень"}

        case points < 5:  
            return {name : "Поведінкова регуляція", stans: 10, mark: `${points}`, anwer: "Високий рівень нервово-психічної стійкості і поведінкової регуляції. Високий рівень працездатності, у тому числі і в умовах вираженого стресу. Висока толерантність до несприятливих психічних і фізичних навантажень"}

        default:
            return "WTF_behavioralRegulationCheck";
    }
}

function communicativePotentialCheck(points){
    switch(true) {
        case points >= 23:  
            return {name : "Комунікативний потенціал ", stans: 1, mark: `${points}`, anwer: "Вкрай низький рівень комунікативних здібностей. Наявність виражених ознак акцентуації характеру. Адаптація до нового колективу протікає тривало і украй хворобливо. Постійно випробовує утруднення в побудові міжособистісних контактів з оточуючими. Високий рівень конфліктності. Колективом, як правило, відкидаємо. Фіксований на образах, заподіяних оточуючими, унаслідок чого схилений до ірраціональних вчинків. Вкрай низька здатність до корекції поведінки"}

        case points < 23 && points > 19:  
            return {name : "Комунікативний потенціал ", stans: 2, mark: `${points}`, anwer: "Рівень комунікативних здібностей низький. Наявність ознак акцентуації характеру. Початковий етап адаптації до нового колективу розтягнутий у часі і, як правило, протікає вельми хворобливо. Часто виникають ускладнення в побудові міжособистісних контактів з оточуючими, зважаючи на наявність неадекватної самооцінки. Схильність до підвищеної конфліктності. Хворобливо реагує на критику. Фіксований на образах, що заподіяні йому оточуючими. Недостатньо розвинута здатність до корекції поведінки"}

        case points < 20 && points > 17:  
            return {name : "Комунікативний потенціал ", stans: 3, mark: `${points}`, anwer: "Понижений рівень комунікативних здібностей. Наявність окремих ознак акцентуації характеру. На початковому етапі адаптації до нового колективу виникають значні ускладнення. Міжперсональні взаємостосунки (як по горизонталі, так і по вертикалі) часто будує неправильно. Хворобливо реагує на критику. Недостатньо розвинута здатність до корекції своєї поведінки"}

        case points < 18 && points > 14:  
            return {name : "Комунікативний потенціал ", stans: 4, mark: `${points}`, anwer: "Задовільний рівень комунікативних здібностей. На початковому етапі адаптації до нового колективу можуть виникати ускладнення. Не завжди правильно будує міжперсональні взаємостосунки, зважаючи на деяку неадекватність самооцінки. На критичні зауваження на свою адресу в основному реагує адекватно, хоча і дещо хворобливо. В цілому здатний до корекції своєї поведінки"}

        case points < 15 && points > 12:  
            return {name : "Комунікативний потенціал ", stans: 5, mark: `${points}`, anwer: "Рівень комунікативних здібностей середній. У цілому без особливих ускладнень адаптується до нового колективу. При встановленні міжособистісних контактів з оточуючими іноді може неправильно будувати стратегію своєї поведінки. Разом з тим, до критичних зауважень відноситься адекватно, здатний коригувати свою поведінку. У спілкуванні не конфліктний. Достатньо адекватно оцінює свою роль у колективі"}

        case points < 13 && points > 10:  
            return {name : "Комунікативний потенціал ", stans: 6, mark: `${points}`, anwer: "Достатній рівень комунікативних здібностей. Достатньо швидко адаптується у новому колективі. При встановленні міжособистісних контактів з оточуючими, як правило, не зазнає труднощів. У спілкуванні не конфліктний. У більшості випадків адекватно оцінює свою роль в колективі. На критику реагує адекватно. Достатня здатність до корекції поведінки"}

        case points < 11 && points > 8:  
            return {name : "Комунікативний потенціал ", stans: 7, mark: `${points}`, anwer: "Достатньо високий рівень комунікативних здібностей. Достатньо швидко адаптується у новому колективі. При встановленні міжособистісних контактів з оточуючими, як правило, не зазнає труднощів. У спілкуванні не конфліктний. У більшості випадків адекватно оцінює свою роль в колективі. На критику реагує адекватно. Достатня здатність до корекції поведінки"}

        case points < 9 && points > 6:  
            return {name : "Комунікативний потенціал ", stans: 8, mark: `${points}`, anwer: "Високий рівень комунікативних здібностей. Швидко адаптується у новому колективі. Легко встановлює контакти з оточуючими.У міжособистісному спілкуванні неконфліктний. Завжди адекватно оцінює свою роль і правильно будує міжперсональні взаємостосунки у колективі"}

        case points === 6:  
            return {name : "Комунікативний потенціал ", stans: 9, mark: `${points}`, anwer: "Високий рівень комунікативних здібностей. Швидко адаптується у новому колективі. Легко встановлює контакти з оточуючими.У міжособистісному спілкуванні неконфліктний. Завжди адекватно оцінює свою роль і правильно будує міжперсональні взаємостосунки у колективі"}

        case points < 5:  
            return {name : "Комунікативний потенціал ", stans: 10, mark: `${points}`, anwer: "Високий рівень комунікативних здібностей. Швидко адаптується у новому колективі. Легко встановлює контакти з оточуючими.У міжособистісному спілкуванні неконфліктний. Завжди адекватно оцінює свою роль і правильно будує міжперсональні взаємостосунки у колективі"}

        default:
            return "WTF_communicativePotentialCheck";
    }
}


function moralAndEthicalNormsCheck(points){
    switch(true) {
        case points >= 17:  
            return {name : "Морально-етична нормативність  ", stans: 1, mark: `${points}`, anwer: "Вкрай низький рівень соціалізації (значно відмінний від номінальних значень для даної вікової групи). Вважає за краще діяти згідно власних планів, не рахуючись з думкою оточуючих. Особистісні інтереси домінують над груповими. Для досягнення особистісних інтересів ігноруються загальноприйняті норми і правила поведінки"}

        case points === 16:  
            return {name : "Морально-етична нормативність  ", stans: 2, mark: `${points}`, anwer: "Низький рівень соціалізації. Не прагне дотримуватися загальноприйнятих норм поведінки. В основному вважає за краще діяти згідно власних планів, не орієнтуючись на думку оточуючих. В повсякденній життєдіяльності переважають егоцентричні тенденції. Особистісні інтереси переважають над інтересами групи. Досягнення особистісних інтересів може здійснювати в обхід існуючих заборон і правил"}

        case points < 16 && points > 13:  
            return {name : "Морально-етична нормативність  ", stans: 3, mark: `${points}`, anwer: "Недостатній рівень соціалізації. В цілому не прагне дотримуватися загальноприйнятих норм поведінки і соціально ухвалених вимог. В повсякденній життєдіяльності особистісні інтереси переважають над груповими"}

        case points < 14 && points > 11:  
            return {name : "Морально-етична нормативність ", stans: 4, mark: `${points}`, anwer: "Задовільний рівень соціалізації. Не завжди орієнтований на дотримання загальноприйнятих і соціально ухвалених норми поведінки. У повсякденній життєдіяльності особистісні інтереси, як правило, переважають над груповими "}

        case points < 12 && points > 9:  
            return {name : "Морально-етична нормативність  ", stans: 5, mark: `${points}`, anwer: "В цілому достатній рівень соціалізації. Прагне дотримуватися загальноприйнятих і соціально ухвалених норм поведінки. У повсякденній життєдіяльності групові інтереси, як правило, переважають над особистісними інтересами"}

        case points < 10 && points > 7:  
            return {name : "Морально-етична нормативність  ", stans: 6, mark: `${points}`, anwer: "Достатній рівень соціалізації. У цілому орієнтований на дотримання загальноприйнятих і соціально ухвалених норм поведінки. У цілому дотримується корпоративних вимог. В повсякденній життєдіяльності групові інтереси, як правило, переважають над особистісними інтересами"}

        case points === 7:  
            return {name : "Морально-етична нормативність  ", stans: 7, mark: `${points}`, anwer: "Достатньо високий рівень соціалізації. Орієнтований на дотримання загальноприйнятих і соціально ухвалених норм поведінки. Дотримується корпоративних вимог. У повсякденній життєдіяльності групові інтереси, як правило, переважають над особистісними інтересами"}

        case points < 7 && points > 4:  
            return {name : "Морально-етична нормативність  ", stans: 8, mark: `${points}`, anwer: "Високий рівень соціалізації. Суворо орієнтований на загальноприйняті і соціально ухвалені норми поведінки. Схильний дотримуватися корпоративних вимог. У повсякденній діяльності групові інтереси ставить вище особистісних"}

        case points === 4:  
            return {name : "Морально-етична нормативність  ", stans: 9, mark: `${points}`, anwer: "Дуже високий рівень соціалізації. Суворо орієнтований на загальноприйняті і соціально схвалювані норми поведінки. Суворо дотримується корпоративних вимог. У повсякденній діяльності групові інтереси ставить вище особистісних. Виражені альтруїстські якості"}

        case points < 3:  
            return {name : "Морально-етична нормативність  ", stans: 10, mark: `${points}`, anwer: "Дуже високий рівень соціалізації. Суворо орієнтований на загальноприйняті і соціально схвалювані норми поведінки. Суворо дотримується корпоративних вимог. У повсякденній діяльності групові інтереси ставить вище особистісних. Виражені альтруїстські якості"}

        default:
            return "WTF_moralAndEthicalNormsCheck";
    }
}

function militaryProfessionalOrientationCheck(points){
    switch(true) {
        case points < 26 && points > 17:  
            return {name : "Військово-професійна спрямованість", stans: 1, mark: `${points}`, anwer: "Низький рівень військово-професійної спрямованості. Не задоволений своєю військовою професійною діяльністю і службовим призначенням"}

        case points < 18 && points > 15:  
            return {name : "Військово-професійна спрямованість", stans: 2, mark: `${points}`, anwer: "Низький рівень військово-професійної спрямованості. Не задоволений своєю військовою професійною діяльністю і службовим призначенням"}

        case points < 16 && points > 13:  
            return {name : "Військово-професійна спрямованість", stans: 3, mark: `${points}`, anwer: "Низький рівень військово-професійної спрямованості. Не задоволений своєю військовою професійною діяльністю і службовим призначенням"}

        case points < 14 && points > 10:  
            return {name : "Військово-професійна спрямованість", stans: 4, mark: `${points}`, anwer: "Недостатній рівень військово-професійної спрямованості. Не повною мірою задоволений своєю військовою професійною діяльністю і службовим призначенням. Орієнтація на продовження професійної діяльності сумнівна"}

        case points < 11 && points > 7:  
            return {name : "Військово-професійна спрямованість", stans: 5, mark: `${points}`, anwer: "В цілому достатній рівень військово-професійної спрямованості. Орієнтований на продовження професійної діяльності, у тому числі і в особливих умовах"}

        case points < 8 && points > 4:  
            return {name : "Військово-професійна спрямованість", stans: 6, mark: `${points}`, anwer: "Достатній рівень військово-професійної спрямованості. Стійка орієнтація на продовження професійної діяльності, у тому числі і в особливих умовах"}

        case points === 4:  
            return {name : "Військово-професійна спрямованість", stans: 7, mark: `${points}`, anwer: "Достатній рівень військово-професійної спрямованості. Стійка орієнтація на продовження професійної діяльності, у тому числі і в особливих умовах"}

        case points < 4 && points > 1:  
            return {name : "Військово-професійна спрямованість", stans: 8, mark: `${points}`, anwer: "Високий рівень військово-професійної спрямованості. Виражене бажання продовжувати професійну діяльність, у тому числі і в особливих умовах"}

        case points === 1:  
            return {name : "Військово-професійна спрямованість", stans: 9, mark: `${points}`, anwer: "Високий рівень військово-професійної спрямованості. Виражене бажання продовжувати професійну діяльність, у тому числі і в особливих умовах"}

        case points === 0:  
            return {name : "Військово-професійна спрямованість", stans: 10, mark: `${points}`, anwer: "Високий рівень військово-професійної спрямованості. Виражене бажання продовжувати професійну діяльність, у тому числі і в особливих умовах"}

        default:
            return "WTF_militaryProfessionalOrientationCheck";
    }
}

function predispositionToDeviantBehaviorsCheck(points){
    switch(true) {
        case points >= 25:  
            return {name : "Схильність до девіантних форм поведінки", stans: 1, mark: `${points}`, anwer: "Наявність виразних ознак девіантних (аддиктивної і делинквентної) форм поведінки. Наявність виражених агресивних реакцій відносно оточуючих. Як правило, міжперсональні взаємостосунки з ровесниками і із старшими за віком будує нераціонально. Не орієнтований на дотримання соціально ухвалених норм поведінки."}

        case points < 25 && points > 20:  
            return {name : "Схильність до девіантних форм поведінки", stans: 2, mark: `${points}`, anwer: "Наявність виразних ознак девіантних (аддиктивної і делинквентної) форм поведінки. Наявність виражених агресивних реакцій відносно оточуючих. Як правило, міжперсональні взаємостосунки з ровесниками і із старшими за віком будує нераціонально. Не орієнтований на дотримання соціально ухвалених норм поведінки."}

        case points < 21 && points > 17:  
            return {name : "Схильність до девіантних форм поведінки", stans: 3, mark: `${points}`, anwer: "Відзначено наявність деяких ознак девіантних (аддиктивної і делинквентної) форм поведінки. Наявність агресивних реакцій відносно оточуючих. Схильність до нераціональної побудови міжперсональних взаємостосунків з ровесниками і із старшими за віком. Схильний допускати порушення соціально ухвалених норм поведінки"}

        case points < 18 && points > 14:  
            return {name : "Схильність до девіантних форм поведінки", stans: 4, mark: `${points}`, anwer: "Відзначено наявність деяких ознак девіантних (аддиктивної і делинквентної) форм поведінки. Наявність агресивних реакцій відносно оточуючих. Схильність до нераціональної побудови міжперсональних взаємостосунків з ровесниками і із старшими за віком. Схильний допускати порушення соціально ухвалених норм поведінки"}

        case points < 15 && points > 11:  
            return {name : "Схильність до девіантних форм поведінки", stans: 5, mark: `${points}`, anwer: "В цілому виражені ознаки девіантних (аддиктивної і делинквентної) форм поведінки відсутні. Відмічається наявність окремих ознак нераціональної побудови міжперсональних взаємостосунків з ровесниками і із старшими за віком. Іноді допускає порушення соціально ухвалених норм поведінки"}

        case points < 12 && points > 9:  
            return {name : "Схильність до девіантних форм поведінки", stans: 6, mark: `${points}`, anwer: "Відсутність  ознак девіантних (аддиктивної і делинквентної) форм поведінки. Відсутність ознак агресивної поведінки відносно оточуючих. Орієнтація на дотримання соціально ухвалених норм поведінки і раціональну побудову міжперсональних взаємостосунків з ровесниками і із старшими за віком"}

        case points < 10 && points > 7:  
            return {name : "Схильність до девіантних форм поведінки", stans: 7, mark: `${points}`, anwer: "Відсутність  ознак девіантних (аддиктивної і делинквентної) форм поведінки. Відсутність ознак агресивної поведінки відносно оточуючих. Орієнтація на дотримання соціально ухвалених норм поведінки і раціональну побудову міжперсональних взаємостосунків з ровесниками і із старшими за віком"}

        case points < 8 && points > 5:  
            return {name : "Схильність до девіантних форм поведінки", stans: 8, mark: `${points}`, anwer: "Відсутність  ознак девіантних (аддиктивної і делинквентної) форм поведінки. Відсутність ознак агресивної поведінки відносно оточуючих. Орієнтація на дотримання соціально ухвалених норм поведінки і раціональну побудову міжперсональних взаємостосунків з ровесниками і із старшими за віком"}

        case points < 6 && points > 3:  
            return {name : "Схильність до девіантних форм поведінки", stans: 9, mark: `${points}`, anwer: "Відсутність  ознак суїцидального ризику."}

        case points < 4 :  
            return {name : "Схильність до девіантних форм поведінки", stans: 10, mark: `${points}`, anwer: "Відсутність  ознак девіантних (аддиктивної і делинквентної) форм поведінки. Відсутність ознак агресивної поведінки відносно оточуючих. Орієнтація на дотримання соціально ухвалених норм поведінки і раціональну побудову міжперсональних взаємостосунків з ровесниками і із старшими за віком"}

        default:
            return "WTF_predispositionToDeviantBehaviorsCheck";
    }
}

function suicidalRiskCheck(points){
    switch(true) {
        case points >= 15:  
            return {name : "Суїцидальний ризик", stans: 1, mark: `${points}`, anwer: "Відзначена наявність виразних ознак суїцидальної схильності. За наявності затяжної військово-професійної адаптації або труднощів в міжперсональних взаємостосунках з ровесниками і із старшими по віку можуть виникнути думки про суїцидальний шантаж або закінчені суїцидальні дії."}

        case points < 15 && points > 9:  
            return {name : "Суїцидальний ризик", stans: 2, mark: `${points}`, anwer: "Відзначена наявність виразних ознак суїцидальної схильності. За наявності затяжної військово-професійної адаптації або труднощів в міжперсональних взаємостосунках з ровесниками і із старшими по віку можуть виникнути думки про суїцидальний шантаж або закінчені суїцидальні дії."}

        case points < 10 && points > 6:  
            return {name : "Суїцидальний ризик", stans: 3, mark: `${points}`, anwer: "Відзначена наявність окремих ознак суїцидальної схильності. За наявності затяжної військово-професійної адаптації або труднощів у міжперсональних взаємостосунках з ровесниками і із старшими за віком можуть виникнути думки суїцидальної спрямованості."}

        case points < 7 && points > 4:  
            return {name : "Суїцидальний ризик", stans: 4, mark: `${points}`, anwer: "Відзначена наявність окремих ознак суїцидальної схильності. За наявності затяжної військово-професійної адаптації або труднощів у міжперсональних взаємостосунках з ровесниками і із старшими за віком можуть виникнути думки суїцидальної спрямованості."}

        case points === 4:  
            return {name : "Суїцидальний ризик", stans: 5, mark: `${points}`, anwer: "В цілому виразних ознак суїцидальної схильності не виявлено. Наголошується наявність окремих ознак, що свідчать про певні труднощі в міжперсональних взаємостосунках з ровесниками і (або) із старшими по віку"}

        case points === 3:  
            return {name : "Суїцидальний ризик", stans: 6, mark: `${points}`, anwer: "Відсутність  ознак суїцидального ризику."}

        case points === 2: 
            return {name : "Суїцидальний ризик", stans: 7, mark: `${points}`, anwer: "Відсутність  ознак суїцидального ризику."}

        case points === 1:  
            return {name : "Суїцидальний ризик", stans: 8, mark: `${points}`, anwer: "Відсутність  ознак суїцидального ризику."}

        case points === 0: 
            return {name : "Суїцидальний ризик", stans: 9, mark: `${points}`, anwer: "Відсутність  ознак суїцидального ризику."}

        case points < 0 :  
            return {name : "Суїцидальний ризик", stans: 10, mark: `${points}`, anwer: "Відсутність  ознак суїцидального ризику."}

        default:
            return "WTF_suicidalRiskCheck";
    }
}

function levelOfResistanceToCombatStressCheck(points){
    switch(true) {
        case points >= 87:  
            return {name : "Рівень стійкості до бойового стресу", stans: 1, mark: `${points}`, anwer: "4-Й РІВЕНЬ СТІЙКОСТІ ДО БОЙОВОГО СТРЕСУ. Недостатній рівень розвитку адаптаційних можливостей особистості. Не відповідає вимогам, що пред'являються до військовослужбовців в умовах бойової діяльності. "}

        case points < 87 && points > 74:  
            return {name : "Рівень стійкості до бойового стресу", stans: 2, mark: `${points}`, anwer: "4-Й РІВЕНЬ СТІЙКОСТІ ДО БОЙОВОГО СТРЕСУ. Недостатній рівень розвитку адаптаційних можливостей особистості. Не відповідає вимогам, що пред'являються до військовослужбовців в умовах бойової діяльності. "}

        case points < 75 && points > 62:  
            return {name : "Рівень стійкості до бойового стресу", stans: 3, mark: `${points}`, anwer: "3-Й РІВЕНЬ СТІЙКОСТІ ДО БОЙОВОГО СТРЕСУ. Задовільний рівень розвитку адаптаційних можливостей особистості. Мінімально відповідає вимогам, що пред'являються до військовослужбовців в умовах бойової діяльності."}

        case points < 63 && points > 50:  
            return {name : "Рівень стійкості до бойового стресу", stans: 4, mark: `${points}`, anwer: "3-Й РІВЕНЬ СТІЙКОСТІ ДО БОЙОВОГО СТРЕСУ. Задовільний рівень розвитку адаптаційних можливостей особистості. Мінімально відповідає вимогам, що пред'являються до військовослужбовців в умовах бойової діяльності."}

        case points < 51 && points > 39: 
            return {name : "Рівень стійкості до бойового стресу", stans: 5, mark: `${points}`, anwer: "2-Й РІВЕНЬ СТІЙКОСТІ ДО БОЙОВОГО СТРЕСУ. Достатній рівень розвитку адаптаційних можливостей особистості. В основному відповідає вимогам, що пред'являються до військовослужбовців в умовах бойової діяльності."}

        case points < 40 && points > 30: 
            return {name : "Рівень стійкості до бойового стресу", stans: 6, mark: `${points}`, anwer: "2-Й РІВЕНЬ СТІЙКОСТІ ДО БОЙОВОГО СТРЕСУ. Достатній рівень розвитку адаптаційних можливостей особистості. В основному відповідає вимогам, що пред'являються до військовослужбовців в умовах бойової діяльності."}

        case points < 31 && points > 24: 
            return {name : "Рівень стійкості до бойового стресу", stans: 7, mark: `${points}`, anwer: "2-Й РІВЕНЬ СТІЙКОСТІ ДО БОЙОВОГО СТРЕСУ. Достатній рівень розвитку адаптаційних можливостей особистості. В основному відповідає вимогам, що пред'являються до військовослужбовців в умовах бойової діяльності."}

        case points < 25 && points > 20: 
            return {name : "Рівень стійкості до бойового стресу", stans: 8, mark: `${points}`, anwer: "1-Й РІВЕНЬ СТІЙКОСТІ ДО БОЙОВОГО СТРЕСУ. Високий рівень розвитку адаптаційних можливостей особистості. Повністю відповідає вимогам, що пред'являються до військовослужбовців в умовах бойової діяльності."}

        case points < 21 && points > 17: 
            return {name : "Рівень стійкості до бойового стресу", stans: 9, mark: `${points}`, anwer: "1-Й РІВЕНЬ СТІЙКОСТІ ДО БОЙОВОГО СТРЕСУ. Високий рівень розвитку адаптаційних можливостей особистості. Повністю відповідає вимогам, що пред'являються до військовослужбовців в умовах бойової діяльності."}

        case points < 17: 
            return {name : "Рівень стійкості до бойового стресу", stans: 10, mark: `${points}`, anwer: "1-Й РІВЕНЬ СТІЙКОСТІ ДО БОЙОВОГО СТРЕСУ. Високий рівень розвитку адаптаційних можливостей особистості. Повністю відповідає вимогам, що пред'являються до військовослужбовців в умовах бойової діяльності."}

        default:
            return "WTF_levelOfResistanceToCombatStressCheck";
    }
}


function engine (data) {
        const veracityQuestions = [1,10,19,31,51,69,78,92,101,116,128,138,148];
        const verRes = veracityQuestions.map(elem => data[elem]).filter(elem => elem === false).length
        console.log(verRes)
        const verResultString = veracityCheck(verRes)

        const PRquestionsPositive = [4, 6, 7, 8, 11, 12, 15, 16, 17, 18, 20, 21, 28, 29, 30, 36, 37, 39, 40, 41, 47, 57, 60, 63, 65, 67, 68, 70, 73, 80, 82, 83, 84, 86, 89, 94, 95, 96, 98, 102, 103, 108, 109, 110, 111, 112, 113, 115, 117, 118, 119, 120, 122, 123, 124, 125, 127, 129, 131, 135, 136, 137, 139, 143, 146, 149, 153, 154, 155, 156, 157, 158, 161, 162];
        const PRquestionsNegative = [2, 3, 5, 23, 25, 32, 38, 44, 45, 52, 53, 54, 55, 58, 62, 66, 75, 87, 105, 132,134, 140]
        const PRresult = PRquestionsPositive.map(elem => data[elem]).filter(elem => elem === true).length + PRquestionsNegative.map(elem => data[elem]).filter(elem => elem === false).length
        const PRresultString = behavioralRegulationCheck(PRresult)


        const KPquestionsPositive = [9, 24, 27, 43, 46, 61, 64, 81, 88, 90, 99, 104, 106, 114, 121, 126, 133, 142, 151, 152]
        const KPquestionsNegative = [26, 34, 35, 48, 49, 74, 85, 107, 130, 144, 147, 159]
        const KPresult = KPquestionsPositive.map(elem => data[elem]).filter(elem => elem === true).length + KPquestionsNegative.map(elem => data[elem]).filter(elem => elem === false).length
        const KPresultString = communicativePotentialCheck(KPresult)

        const MNquestionsPositive = [14, 22, 33, 42, 50, 56, 59, 71, 72, 77, 79, 91, 93, 141,145, 150, 164, 165]
        const MNquestionsNegative = [13, 76, 97, 100, 160, 163]
        const MNresult = MNquestionsPositive.map(elem => data[elem]).filter(elem => elem === true).length + MNquestionsNegative.map(elem => data[elem]).filter(elem => elem === false).length
        const MNresultString = moralAndEthicalNormsCheck(MNresult)

        const VPSquestionsPositive = [166, 167, 168, 169, 170, 172, 173, 174, 175, 176, 177, 179, 180, 181, 183, 184, 185, 186, 187, 188, 190]
        const VPSquestionsNegative = [171, 178, 182, 189]
        const VPSresult = VPSquestionsPositive.map(elem => data[elem]).filter(elem => elem === true).length + VPSquestionsNegative.map(elem => data[elem]).filter(elem => elem === false).length
        const VPSresultString = militaryProfessionalOrientationCheck(VPSresult)

        const DAPquestionsPositive = [6, 9, 14, 15, 22, 36, 39, 42, 47, 50, 56, 59, 71, 72, 91, 93, 117,127, 141, 145, 151, 152, 164, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200]
        const DAPquestionsNegative = [13, 100, 163]
        const DAPresult = DAPquestionsPositive.map(elem => data[elem]).filter(elem => elem === true).length + DAPquestionsNegative.map(elem => data[elem]).filter(elem => elem === false).length
        const DAPresultString = predispositionToDeviantBehaviorsCheck(DAPresult)

        const SquestionsPositive = [4, 8, 10, 28, 29, 39, 41, 47, 70, 84, 115, 119, 124, 136, 137, 149, 154, 155]
        const SquestionsNegative = [32, 105]
        const Sresult = SquestionsPositive.map(elem => data[elem]).filter(elem => elem === true).length + SquestionsNegative.map(elem => data[elem]).filter(elem => elem === false).length
        const SresultString = suicidalRiskCheck(Sresult)

        const OAP = PRresult + KPresult + MNresult;
        const OAPresultString = levelOfResistanceToCombatStressCheck(OAP)

        return {OAPresultString, verResultString, PRresultString, KPresultString, MNresultString,  VPSresultString, DAPresultString, SresultString}
    }

    export default engine;